RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_ramecc.c
    /* Change RAMECC peripheral state */
    hramecc->State = HAL_RAMECC_STATE_READY;
  }
  else
  {
    /* Update the error code */
    hramecc->ErrorCode = HAL_RAMECC_ERROR_BUSY;

    /* Return HAL status */
    return HAL_ERROR;
  }

  /* Return HAL status */
  return HAL_OK;
}


/**
  * @brief  Disable the RAMECC error interrupts.
  * @param  hramecc        Pointer to a RAMECC_HandleTypeDef structure that
  *                        contains the configuration information for the
  *                        specified RAMECC Monitor.
  * @param  Notifications  Select the notification.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_RAMECC_DisableNotification(RAMECC_HandleTypeDef *hramecc, uint32_t Notifications)
{
  /* Check the parameters */
  assert_param(IS_RAMECC_MONITOR_ALL_INSTANCE(hramecc->Instance));
  assert_param(IS_RAMECC_INTERRUPT(Notifications));

  /* Check RAMECC state */
  if (hramecc->State == HAL_RAMECC_STATE_READY)
  {
    /* Change RAMECC peripheral state */
    hramecc->State = HAL_RAMECC_STATE_BUSY;

    /* Disable RAMECC interrupts */
    __HAL_RAMECC_DISABLE_IT(hramecc, Notifications);

    /* Change RAMECC peripheral state */
    hramecc->State = HAL_RAMECC_STATE_READY;
  }
  else
  {
    /* Update the error code */
    hramecc->ErrorCode = HAL_RAMECC_ERROR_BUSY;

    /* Return HAL status */
    return HAL_ERROR;
  }

  /* Return HAL status */
  return HAL_OK;
}


/** @addtogroup RAMCECC_Exported_Functions_Group3
  *
@verbatim
 ===============================================================================
               ##### Handle Interrupt and Callbacks Functions  #####
 ===============================================================================
    [..]
    This section provides functions to handle RAMECC interrupts and
    Register / UnRegister the different callbacks.
    [..]
    The HAL_RAMECC_IRQHandler() function allows handling the active RAMECC
    interrupt request.
    The HAL_RAMECC_RegisterCallback() function allows registering the selected
    RAMECC callbacks.
    The HAL_RAMECC_UnRegisterCallback() function allows unregistering the
    selected RAMECC callbacks.
@endverbatim
  * @{
  */

/**
  * @brief  Handles RAMECC interrupt request.
  * @param  hramecc  Pointer to a RAMECC_HandleTypeDef structure that contains
  *                  the configuration information for the specified RAMECC
  *                  Monitor.
  * @retval None.
  */
void HAL_RAMECC_IRQHandler(RAMECC_HandleTypeDef *hramecc)
{
  uint32_t  monitor_it_source;
  uint32_t  global_it_source;

  monitor_it_source = READ_REG(hramecc->Instance->CR);
  global_it_source  = READ_REG(((RAMECC_TypeDef *)((uint32_t)hramecc->Instance & 0xFFFFFF00U))->IER);

  /* Single Error Interrupt Management ****************************************/
  if (((monitor_it_source & RAMECC_CR_ECCSEIE)   == RAMECC_CR_ECCSEIE)   ||
      ((global_it_source  & RAMECC_IER_GECCSEIE) == RAMECC_IER_GECCSEIE) ||
      ((global_it_source  & RAMECC_IER_GIE)      == RAMECC_IER_GIE))
  {
    if (__HAL_RAMECC_GET_FLAG(hramecc, RAMECC_FLAG_SINGLEERR_R) != 0U)
    {
      /* Clear active flags */
      __HAL_RAMECC_CLEAR_FLAG(hramecc, RAMECC_FLAG_SINGLEERR_R);

#if (USE_HAL_RAMECC_REGISTER_CALLBACKS == 1)
      /* Check if a valid single error callback is registered */
      if (hramecc->DetectSingleErrorCallback != NULL)
      {
        /* Single error detection callback */
        hramecc->DetectSingleErrorCallback(hramecc);
      }
#else
      HAL_RAMECC_DetectSingleErrorCallback(hramecc);
#endif /* USE_HAL_RAMECC_REGISTER_CALLBACKS */
    }
  }

  /* Double Error Interrupt Management ****************************************/
  if (((monitor_it_source & RAMECC_CR_ECCDEIE)     == RAMECC_CR_ECCDEIE)     ||
      ((monitor_it_source & RAMECC_CR_ECCDEBWIE)   == RAMECC_CR_ECCDEBWIE)   ||
      ((global_it_source  & RAMECC_IER_GECCDEIE)   == RAMECC_IER_GECCDEIE)   ||
      ((global_it_source  & RAMECC_IER_GECCDEBWIE) == RAMECC_IER_GECCDEBWIE) ||
      ((global_it_source  & RAMECC_IER_GIE)        == RAMECC_IER_GIE))
  {
    /* ECC double error detected flag */
    if (__HAL_RAMECC_GET_FLAG(hramecc, RAMECC_FLAG_DOUBLEERR_R) != 0U)
    {
      /* Clear active flags */
      __HAL_RAMECC_CLEAR_FLAG(hramecc, RAMECC_FLAG_DOUBLEERR_R);

#if (USE_HAL_RAMECC_REGISTER_CALLBACKS == 1)
      /* Check if a valid Double error callback is registered */
      if (hramecc->DetectDoubleErrorCallback != NULL)
      {
        /* Double error detection callback */
        hramecc->DetectDoubleErrorCallback(hramecc);
      }
#else
      HAL_RAMECC_DetectDoubleErrorCallback(hramecc);
#endif /* USE_HAL_RAMECC_REGISTER_CALLBACKS */
    }

    /* ECC double error on byte write */
    if (__HAL_RAMECC_GET_FLAG(hramecc, RAMECC_FLAG_DOUBLEERR_W) != 0U)
    {
      /* Clear active flags */
      __HAL_RAMECC_CLEAR_FLAG(hramecc, RAMECC_FLAG_DOUBLEERR_W);

#if (USE_HAL_RAMECC_REGISTER_CALLBACKS == 1)
      /* Check if a valid Double error callback is registered */
      if (hramecc->DetectDoubleErrorCallback != NULL)
      {
        /* Double error detection callback */
        hramecc->DetectDoubleErrorCallback(hramecc);
      }
#else
      HAL_RAMECC_DetectDoubleErrorCallback(hramecc);
#endif /* USE_HAL_RAMECC_REGISTER_CALLBACKS */
    }
  }
}

/**
  * @brief  RAMECC single error detection callback.
  * @param  hramecc : Pointer to a RAMECC_HandleTypeDef structure that contains
  *                   the configuration information for the specified RAMECC.
  * @retval None.
  */
__weak void HAL_RAMECC_DetectSingleErrorCallback(RAMECC_HandleTypeDef *hramecc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hramecc);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_RAMECC_DetectSingleErrorCallback can be implemented in
            the user file.                                                    */
}

/**
  * @brief  RAMECC double error detection callback.
  * @param  hramecc : Pointer to a RAMECC_HandleTypeDef structure that contains
  *                   the configuration information for the specified RAMECC.
  * @retval None.
  */
__weak void HAL_RAMECC_DetectDoubleErrorCallback(RAMECC_HandleTypeDef *hramecc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hramecc);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_RAMECC_DetectDoubleErrorCallback can be implemented in
            the user file.                                                    */
}

#if (USE_HAL_RAMECC_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register RAMECC callbacks.
  * @param  hramecc       : Pointer to a RAMECC_HandleTypeDef structure that
  *                         contains the configuration information for the
  *                         specified RAMECC instance.
  * @param  CallbackID    : User Callback identifier a HAL_RAMECC_CallbackIDTypeDef
  *                         ENUM as parameter.
  * @param  pCallback     : Pointer to private callback function.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_RAMECC_RegisterCallback(RAMECC_HandleTypeDef *hramecc,
                                              HAL_RAMECC_CallbackIDTypeDef CallbackID,
                                              void (* pCallback)(RAMECC_HandleTypeDef *_hramecc))
{
  HAL_StatusTypeDef status = HAL_OK;

  if (pCallback == NULL)
  {
    /* Update the error code and return error */
    hramecc->ErrorCode |= HAL_RAMECC_ERROR_INVALID_CALLBACK;
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_RAMECC_MONITOR_ALL_INSTANCE(hramecc->Instance));

  /* Check RAMECC state */
  if (hramecc->State == HAL_RAMECC_STATE_READY)
  {
    switch (CallbackID)
    {
      case  HAL_RAMECC_SE_DETECT_CB_ID:
        /* Register single error callback */
        hramecc->DetectSingleErrorCallback = pCallback;
        break;

