RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_ramecc.c
      case  HAL_RAMECC_DE_DETECT_CB_ID:
        /* Register double error callback */
        hramecc->DetectDoubleErrorCallback = pCallback;
        break;

      case HAL_RAMECC_MSPINIT_CB_ID :
        /* Register msp init callback */
        hramecc->MspInitCallback = pCallback;
        break;

      case HAL_RAMECC_MSPDEINIT_CB_ID :
        /* Register msp de-init callback */
        hramecc->MspDeInitCallback = pCallback;
        break;

      default:
        /* Update the error code and return error */
        hramecc->ErrorCode |= HAL_RAMECC_ERROR_INVALID_CALLBACK;
        status = HAL_ERROR;
        break;
    }
  }
  else if (hramecc->State == HAL_RAMECC_STATE_RESET)
  {
    switch (CallbackID)
    {
      case HAL_RAMECC_MSPINIT_CB_ID :
        /* Register msp init callback */
        hramecc->MspInitCallback = pCallback;
        break;

      case HAL_RAMECC_MSPDEINIT_CB_ID :
        /* Register msp de-init callback */
        hramecc->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code and return error */
        hramecc->ErrorCode |= HAL_RAMECC_ERROR_INVALID_CALLBACK;
        status =  HAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code and return error  */
    hramecc->ErrorCode = HAL_RAMECC_ERROR_INVALID_CALLBACK;
    status = HAL_ERROR;
  }

  return status;
}

/**
  * @brief  UnRegister RAMECC callbacks.
  * @param  hramecc       : Pointer to a RAMECC_HandleTypeDef structure that
  *                         contains the configuration information for the
  *                         specified RAMECC instance.
  * @param  CallbackID    : User Callback identifier a HAL_RAMECC_CallbackIDTypeDef
  *                         ENUM as parameter.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_RAMECC_UnRegisterCallback(RAMECC_HandleTypeDef *hramecc, HAL_RAMECC_CallbackIDTypeDef CallbackID)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check the parameters */
  assert_param(IS_RAMECC_MONITOR_ALL_INSTANCE(hramecc->Instance));

  /* Check RAMECC state */
  if (hramecc->State == HAL_RAMECC_STATE_READY)
  {
    switch (CallbackID)
    {
      case  HAL_RAMECC_SE_DETECT_CB_ID:
        /* UnRegister single error callback */
        hramecc->DetectSingleErrorCallback = NULL;
        break;

      case  HAL_RAMECC_DE_DETECT_CB_ID:
        /* UnRegister double error callback */
        hramecc->DetectDoubleErrorCallback = NULL;
        break;

      case HAL_RAMECC_MSPINIT_CB_ID :
        /* UnRegister msp init callback */
        hramecc->MspInitCallback = NULL;
        break;

      case HAL_RAMECC_MSPDEINIT_CB_ID :
        /* UnRegister msp de-init callback */
        hramecc->MspDeInitCallback = NULL;
        break;

      case  HAL_RAMECC_ALL_CB_ID:
        /* UnRegister all available callbacks */
        hramecc->DetectSingleErrorCallback = NULL;
        hramecc->DetectDoubleErrorCallback = NULL;
        hramecc->MspDeInitCallback         = NULL;
        hramecc->MspInitCallback           = NULL;
        break;

      default:
        /* Return error status */
        status = HAL_ERROR;
        break;
    }
  }
  else if (hramecc->State == HAL_RAMECC_STATE_RESET)
  {
    switch (CallbackID)
    {
      case HAL_RAMECC_MSPINIT_CB_ID :
        /* UnRegister msp init callback */
        hramecc->MspInitCallback = NULL;
        break;

      case HAL_RAMECC_MSPDEINIT_CB_ID :
        /* UnRegister msp de-init callback */
        hramecc->MspDeInitCallback = NULL;
        break;

      case  HAL_RAMECC_ALL_CB_ID:
        /* UnRegister all available callbacks */
        hramecc->MspDeInitCallback = NULL;
        hramecc->MspInitCallback   = NULL;
        break;

      default :
        /* Update the error code */
        hramecc->ErrorCode |= HAL_RAMECC_ERROR_INVALID_CALLBACK;

        /* Update return status */
        status =  HAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code and return error */
    hramecc->ErrorCode = HAL_RAMECC_ERROR_INVALID_CALLBACK;
    status = HAL_ERROR;
  }

  return status;
}
/**
  * @}
  */
#endif /* USE_HAL_RAMECC_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @addtogroup RAMECC_Exported_Functions_Group4
  *
@verbatim
 ===============================================================================
                   #####  Error information functions  #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Get failing address.
      (+) Get failing data low.
      (+) Get failing data high.
      (+) Get hamming bits injected.
      (+) Check single error flag.
      (+) Check double error flag.

@endverbatim
  * @{
  */

/**
  * @brief  Return the RAMECC failing address.
  * @param  hramecc  Pointer to a RAMECC_HandleTypeDef structure that contains
  *                  the configuration information for the specified RAMECC
  *                  Monitor.
  * @retval Failing address offset.
  */
uint32_t HAL_RAMECC_GetFailingAddress(const RAMECC_HandleTypeDef *hramecc)
{
  /* Check the parameters */
  assert_param(IS_RAMECC_MONITOR_ALL_INSTANCE(hramecc->Instance));

  /* Return failing address */
  return hramecc->Instance->FAR;
}


/**
  * @brief  Return the RAMECC data low.
  * @param  hramecc  Pointer to a RAMECC_HandleTypeDef structure that contains
  *                  the configuration information for the specified RAMECC
  *                  Monitor.
  * @retval Failing data low.
  */
uint32_t HAL_RAMECC_GetFailingDataLow(const RAMECC_HandleTypeDef *hramecc)
{
  /* Check the parameters */
  assert_param(IS_RAMECC_MONITOR_ALL_INSTANCE(hramecc->Instance));

  /* Return failing data low */
  return hramecc->Instance->FDRL;
}


/**
  * @brief  Return the RAMECC data high.
  * @param  hramecc  Pointer to a RAMECC_HandleTypeDef structure that contains
  *                  the configuration information for the specified RAMECC
  *                  Monitor.
  * @retval Failing data high.
  */
uint32_t HAL_RAMECC_GetFailingDataHigh(const RAMECC_HandleTypeDef *hramecc)
{
  /* Check the parameters */
  assert_param(IS_RAMECC_MONITOR_ALL_INSTANCE(hramecc->Instance));

  /* Return failing data high */
  return hramecc->Instance->FDRH;
}


/**
  * @brief  Return the RAMECC Hamming bits injected.
  * @param  hramecc  Pointer to a RAMECC_HandleTypeDef structure that contains
  *                  the configuration information for the specified RAMECC
  *                  Monitor.
  * @retval Hamming bits injected.
  */
uint32_t HAL_RAMECC_GetHammingErrorCode(const RAMECC_HandleTypeDef *hramecc)
{
  /* Check the parameters */
  assert_param(IS_RAMECC_MONITOR_ALL_INSTANCE(hramecc->Instance));

  /* Return hamming bits injected */
  return hramecc->Instance->FECR;
}

/**
  * @brief  Check if an ECC single error was occurred.
  * @param  hramecc  Pointer to a RAMECC_HandleTypeDef structure that contains
  *                  the configuration information for the specified RAMECC
  *                  Monitor.
  * @retval State of bit (1 or 0).
  */
uint32_t HAL_RAMECC_IsECCSingleErrorDetected(const RAMECC_HandleTypeDef *hramecc)
{
  /* Check the parameters */
  assert_param(IS_RAMECC_MONITOR_ALL_INSTANCE(hramecc->Instance));

  /* Return the state of SEDC flag */
  return ((READ_BIT(hramecc->Instance->SR, RAMECC_SR_SEDCF) == (RAMECC_SR_SEDCF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if an ECC double error was occurred.
  * @param  hramecc  Pointer to a RAMECC_HandleTypeDef structure that contains
  *                  the configuration information for the specified RAMECC
  *                  Monitor.
  * @retval State of bit (1 or 0).
  */
uint32_t HAL_RAMECC_IsECCDoubleErrorDetected(const RAMECC_HandleTypeDef *hramecc)
{
  /* Check the parameters */
  assert_param(IS_RAMECC_MONITOR_ALL_INSTANCE(hramecc->Instance));

